#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=85c8dd7e2c0e8a199917a033568bd0522253a4ad]
local_file.tfkey: Refreshing state... [id=c769e7f8c3f16337b5c68d3daed4bf554fd95cee]
aws_vpc.main: Refreshing state... [id=vpc-0f6e0cb4df92d7a29]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0d51e79e14e1d9569]
data.aws_ami.java-ami: Reading...
data.aws_ami.java-ami: Read complete after 0s [id=ami-0d5b3eef682c99631]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0565033296c0199ac]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0c115769e0daba35f]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0731b39743ca48c3a]
aws_security_group.allow_http: Refreshing state... [id=sg-0d9fc0d0ed3fe52a9]
aws_security_group.allow_ssh: Refreshing state... [id=sg-06799b5f4fb592cb6]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-05b49b0a64723998c]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-00a57539bbf4ff20e]
aws_security_group.elb: Refreshing state... [id=sg-0175c3a51e8bb1af0]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0f4fa679791e4fade]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-07b4152a4d9eeb462]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0b5c4e347fb2705f4]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0f16864b68e137a2f]
aws_instance.bastion-host: Refreshing state... [id=i-044f1d0b8f407221c]
aws_launch_template.ec2_config: Refreshing state... [id=lt-09271f3836218bcdb]
aws_route_table.private_route_table: Refreshing state... [id=rtb-03ab0f1c1e3527e54]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-03a14e9cbdf67bce2]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-04483617fff8a9a6d]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230131001010762300000005]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-09271f3836218bcdb"
            name    = "terraform-20230131000922308800000001"
          ~ version = "1" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_launch_template.ec2_config will be updated in-place
  ~ resource "aws_launch_template" "ec2_config" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-09271f3836218bcdb"
      ~ image_id                = "ami-0993962b7a8a3f0ae" -> "ami-0d5b3eef682c99631"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "terraform-20230131000922308800000001"
        tags                    = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*